package sumdu.kvp.bot.config;

public enum BotState {
    ENTRY_POINT("ТАКТИЧНА ПІДГОТОВКА"),
    A("ТАКТИЧНА ПІДГОТОВКА"),
    A1("ОБОВ`ЯЗКИ КОМАНДИРА ВІДДІЛЕННЯ"),
    A2("МЕХАНІЗОВАНЕ ВІДДІЛЕННЯ"), A2B1("МЕХАНІЗОВАНЕ ВІДДІЛЕННЯ НА БМП"),  A2B2("МЕХАНІЗОВАНЕ ВІДДІЛЕННЯ НА БТР"),
    A3("РОЗТАШУВАННЯ ВІДДІЛЕННЯ НА МІСЦІ"),
    A4("ДІЇ ВІДДІЛЕННЯ У СТОРОЖОВІЙ ОХОРОНІ"),
    A5("ДІЇ ВІДДІЛЕННЯ У ПОХІДНІЙ ОХОРОНІ"),
    A6("ВІДДІЛЕННЯ НА МАРШІ"),
    A7("ОСНОВНІ ВИДИ ЗАГАЛЬНОВІЙСЬКОВОГО БОЮ"),
    HELP_MENU("ДОПОМОГА"),
    BACK("НАЗАД"),
    BASIC_TOPIC("ЗАГАЛЬНИЙ РОЗДІЛ");

    private final String text;

    BotState(final String text) {
        this.text = text;
    }

    public String toString() {
        return text;
    }
}